

console.log(
  "\x1B[1m1. Верстка валидная (10/10)\x1B[m \n " +
  "\x1B[1m2. Верстка семантическая (указано минимальное количество элементов) (16/16):\x1B[m \n " +
  "\t2.1 header, main, footer (2/2) \n " +
  "\t2.2 шесть элементов section (2/2) \n " +
  "\t2.3 только один заголовок h1 (2/2) \n " +
  "\t2.4 пять заголовков h2 (2/2) \n" +
  "\t2.5 один элемент nav (2/2) \n" +
  "\t2.6 два списка ul > li > a (панель навигации, ссылки на соцсети в футере) (2/2) \n" +
  "\t2.7 семь кнопок button (2/2) \n" +
  "\t2.8 два инпута input (2/2) \n" +
  "\x1B[1mКоличество вышеперечисленных элементов на странице:\x1B[m \n");
console.log(
  "\x1B[1m3. Верстка соответствует макету (54/54)\x1B[m: \n" +
  "\t3.1 блок header (расстояние между элементами 30px, работают как якоря, интерактивны, заголовок h1, расстояние до иконки 40px) (8/8)\n" +
  "\t3.2 секция Welcome (4/4)\n" +
  "\t3.3 секция About (расстояние между кнопками 10px, интерактивны и есть доп. область) (6/6)\n" +
  "\t3.4 секция Favorites (радио кнопки, доп. область, все картинки в проекте, кнопки buy интерактивны, own - нет и disabled) (8/8)\n" +
  "\t3.5 секция CoffeShop (6/6)\n" +
  "\t3.6 секция Contacts (6/6)\n" +
  "\t3.7 секция LibraryCard (сделана форма, допустимые символы в импутах ограничены, кнопки интерактивны) (8/8)\n" +
  "\t3.8 блок footer (адрес библиотеки - ссылка на карту, иконки соцсетей - ссылки, вместо username - имя и ссылка на гитхаб) (8/8)\n" +
  "\x1B[1m4. Общие требования к верстке (20/20):\x1B[m\n" +
  "\t4.1 для построения сетки используются флексы или гриды (2/2)\n" +
  "\t4.2 при уменьшении масштаба страницы браузера вся вёрстка (контент и фоны) размещается по центру, а не сдвигается в сторону (2/2)\n" +
  "\t4.3 иконки добавлены в формате svg (2/2)\n" +
  "\t4.4 изображения добавлены в формате .jpg (.jpeg) или .png (2/2)\n" +
  "\t4.5 есть favicon (2/2)\n" +
  "\t4.6 плавная прокрутка по якорям (2/2)\n" +
  "\t4.7 в футере название ссылки Username заменено и ведет на GitHub студента (2/2)\n" +
  "\t4.8 в футере ссылка The Rolling Scopes School ведет на страницу курса (2/2)\n" +
  "\t4.9 интерактивность элементов согласно макету (2/2)\n" +
  "\t4.10 обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы (2/2)\n" +
  "\x1B[1mИтоговая оценка: 100/100\x1B[m"
)
